# NaN-means not a number

In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
n = np.nan
type(np.nan)

float

In [5]:
m=1
n+m

nan

# nan in Series

In [8]:
s1 = Series([1,2,np.nan,3,4],index = ["A","B","C","D","E"])
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [9]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [10]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [12]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# nan in dataframe

In [14]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])  # 用多维列表创建dataframe

In [16]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [17]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [18]:
dframe.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [23]:
df1 = dframe.dropna(axis = 0,how = "any")  # any只要这一行有nan就删除,how = "all":这一行全是nan才删掉
df1

     0    1    2
0  1.0  2.0  3.0

In [21]:
df1 = dframe.dropna(axis = 1)
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [29]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan,]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [30]:
df2 = dframe2.dropna(thresh = None)
df2

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [31]:
df2 = dframe2.dropna(thresh = 2) #  nan的个数大于2 （不包）的行给删掉
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [32]:
dframe2.fillna(value = 1)  # 将所有的nan填充为1

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [33]:
dframe2.fillna(value = {0:0,1:1,2:2,3:3}) # 第o列的nan填充为0，第1列填充为1，以此类推

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [36]:
df1=dframe
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [37]:
df2 = dframe2
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [39]:
df3 = df1.dropna()
df3

     0    1    2
0  1.0  2.0  3.0

In [40]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [41]:
df1.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0